# 运算符的分类
'''
    1.算数运算符
    2.赋值运算符
    3.复合赋值运算符
    4.比较运算符
    5.逻辑运算符
'''

# 1.算数运算符
'''
    + - * /
    // 整除
    % 取余数
    ** 指数
    () 小括号 提高运算符的优先级的
    混合运算符的优先级顺序：() > ** > * > / > // > % > + -
'''
print(1 + 1)
print(1 - 1)
print(2 * 2)
print(10 / 2)
print(9 // 4)
print(10 % 3)
print(2 ** 4)
print((12 + 14) * 6 + 8)

# 2.赋值运算符
'''
    = 赋值 将等号右侧的结果赋值给等号左侧的变量
    
'''
# 单个变量赋值
num = 1
print(num)

# 多个变量赋值
num1, float1, str1 = 10, 0.5, "hello world"
print(num1)
print(float1)
print(str1)

# 多变量赋相同的值
a = b = c = 10;
print(a)
print(b)
print(c)

# 3.复合赋值运算符
'''
    += 加法赋值运算符 c += a 等价于 c = c + a
    -= 减法赋值运算符 c -= a 等价于 c = c - a
    *= 乘法赋值运算符 c *= a 等价于 c = c * a
    /= 除法赋值运算符 c /= a 等价于 c = c / a
    %= 取余赋值运算符 c %= a 等价于 c = c % a
    //= 整除法赋值运算符 c //= a 等价于 c = c // a
    **= 幂赋值运算符 c **= a 等价于 c = c ** a
'''
a = 100
a += 1
print(a)
# 输出a的值101 a = a + 1 相当于 a = 100 + 1
b = 2
b *= 3
print(b)

c = 10
c += 1 + 2
print(c)
# 普通运算符的优先级要高于复合运算符

# 4.比较运算符 也叫关系预算符 通常是用来判断的
'''
    == 判断相等，如果两个操作数的结果相等则条件结果为true否则结果为false
    != 不等于 如果两个操作数的结果不相等则条件结果为true否则结果为false
    >  大于  运算符的左侧操作数结果是大于右侧操作数的结果，如果大于，则条件为真，否则为假
    <  小于  运算符的左侧操作数结果是小于右侧操作数的结果，如果小于，则条件为真，否则为假
    >= 大于等于  运算符的左侧操作数结果是大于或者等于右侧操作数的结果，如果大于或者等于，则条件为真，否则为假
    <= 小于等于  运算符的左侧操作数结果是小于或者等于右侧操作数的结果，如果小于或者等于，则条件为真，否则为假
'''
a1 = 7
b1 = 5
print(a1 == b1)
print(a1 != b1)
print(a1 > b1)
print(a1 < b1)
print(a1 >= b1)
print(a1 <= b1)
# 5.逻辑运算符
'''
    and 逻辑与运算符
    or  逻辑或
    not 逻辑非
'''
x = True
y = False
print(x and y)
print(x or y)
print(not x)
print(not y)





