'''
    集合：
        创建集合使用{}或set()  但是如果要创建空集合只能使用set(),因为{}用来创建空字典
'''
s1 = {10, 20, 30, 40, 50}
print(s1)   # {50, 20, 40, 10, 30}  乱序
s2 = {10, 20, 10, 20, 30, 40, 50}
print(s2)   # {50, 20, 40, 10, 30} 去重 + 乱序
# Python中集合可以去掉重复的数据
# 集合数据是无序的，故不支持下标访问

s3 = set("abcdefghi")
print(s3)   # {'i', 'f', 'e', 'c', 'a', 'h', 'b', 'g', 'd'} 会自动转化为集合输出
print(type(s3))     # <class 'set'>

s4 = {}
print(type(s4))     # <class 'dict'> {}创建出来的是空字典
s5 = set()
print(type(s5))     # <class 'set'>  set创建出来的空集合
